## <b> ■ 6장. 데이터프레임의 다양한 응용</b>
    파생변수 생성하는 방법
    
    1. 개별원소에 함수 매핑
    2. 시리즈 객체의 함수 매핑
    3. 열의 재구성
    4. 필터링
    5. 데이터프레임 합치기
    6. 그룹연산

### <b> ■ 개별원소에 함수 매핑</b>
    1. 시리즈 원소에 함수 매핑
        문법
            시리즈객체.apply('매핑함수')
        
        시리즈 객체에 apply() 메소드를 적용하면 인자로 전달하는 매핑함수에 시리즈의 모든 원소를 하나씩 입력하고 함수의 리턴값을 돌려받는다.
```python
def add_10(n):
    return n+10

import seaborn as sns
tit = sns.load_dataset('titanic')
sr1 = tit.age.apply(add_10)
sr1
```
    2. 데이터프레임 원소에 함수 매핑
        문법
            데이터프레임객체.applymap('매핑함수')
            
        데이터프레임의 apply(axis=0) 메소드를 적용하면 모든 열을 하나씩 분리하여 매핑함수의 인자로 열(시리즈)에 전달된다.
```python
import seaborn as sns

tit = sns.load_dataset('titanic')
df = tit.loc[:,['age','fare']]

def add_10(n):
    return n+10

df_map = df.applymap(add_10)
df_map.head()
```

In [1]:
def add_10(n):
    return n+10

import seaborn as sns
tit = sns.load_dataset('titanic')
sr1 = tit.age.apply(add_10)
sr1

0      32.0
1      48.0
2      36.0
3      45.0
4      45.0
       ...
886    37.0
887    29.0
888     NaN
889    36.0
890    42.0
Name: age, Length: 891, dtype: float64

### ※ 문제176. 타이타닉 데이터프레임의 age2라는 파생변수를 생성하는데 기존 나이에 10살을 추가한 파생변수를 생성하시오

In [2]:
def add_10(n):
    return n+10

import seaborn as sns

tit = sns.load_dataset('titanic')
tit['age2'] = tit.age.apply(add_10)
tit.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age2
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,32.0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,48.0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,36.0
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,45.0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,45.0

### ※ 문제177. 미국국민의 의료비(insurance.csv)를 Pandas 데이터프레임으로 생성하고 나이가 많을수록 의료비가 많이 드는지 회귀분석 모델로 확인하기 위하여 age2라는 파생변수를 생성하고 기존 나이의 제곱으로 데이터를 생성하시오

In [4]:
def age_sq(n):
    return n**2

import pandas as pd

ins = pd.read_csv('insurance.csv',header=0)
ins['age2']=ins.age.apply(age_sq)
ins.age2

0        361
1        324
2        784
3       1089
4       1024
        ...
1333    2500
1334     324
1335     324
1336     441
1337    3721
Name: age2, Length: 1338, dtype: int64

In [5]:
import seaborn as sns

tit = sns.load_dataset('titanic')
df = tit.loc[:,['age','fare']]

def add_10(n):
    return n+10

df_map = df.applymap(add_10)
df_map.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

### ※ 문제178. kaggle의 타이타닉 데이터에서 이름과 이름의 길이를 출력하시오

In [10]:
import pandas as pd

tit = pd.read_csv('train.csv')

tit['N_length'] = tit.Name.apply(len)
tit[['Name','N_length']]

                                                  Name  N_length
0                              Braund, Mr. Owen Harris        23
1    Cumings, Mrs. John Bradley (Florence Briggs Th...        51
2                               Heikkinen, Miss. Laina        22
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)        44
4                             Allen, Mr. William Henry        24
..                                                 ...       ...
886                              Montvila, Rev. Juozas        21
887                       Graham, Miss. Margaret Edith        28
888           Johnston, Miss. Catherine Helen "Carrie"        40
889                              Behr, Mr. Karl Howell        21
890                                Dooley, Mr. Patrick        19

[891 rows x 2 columns]

### ※ 문제179.위의 결과를 다시 출력하는데 이름의 길이가 가장 긴 승객부터 출력하시오

In [14]:
import pandas as pd

tit = pd.read_csv('train.csv')

tit['N_length'] = tit.Name.apply(len)
tit[['Name','N_length']].sort_values(by='N_length',ascending=False)

                                                  Name  N_length
307  Penasco y Castellana, Mrs. Victor de Satode (M...        82
427  Phillips, Miss. Kate Florence ("Mrs Kate Louis...        67
556  Duff Gordon, Lady. (Lucille Christiana Sutherl...        65
670  Brown, Mrs. Thomas William Solomon (Elizabeth ...        61
25   Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...        57
..                                                 ...       ...
509                                     Lang, Mr. Fang        14
169                                      Ling, Mr. Lee        13
74                                       Bing, Mr. Lee        13
692                                       Lam, Mr. Ali        12
826                                       Lam, Mr. Len        12

[891 rows x 2 columns]

    *데이터프레임의 함수 매핑 문법을 이용해서 결측치를 확인하는 방법
    
    머신러닝 포트폴리오 관련해서 면접질문
        신경망과 관련해서 모델을 많이 안다고 자랑하는 면접자들 말고 데이터 전처리하느라고 머리를 쥐어 뜯었던 경험담을 늘어놓는 사람들을 뽑아라

### ※ 문제180. seaborn 타이타닉의 age와 fare에 결측치가 얼마나 있는지 확인하시오

In [15]:
import seaborn as sns

tit = sns.load_dataset('titanic')
df = tit.loc[:,['age','fare']]

def missing_values(series):
    return series.isnull()

rs = df.apply(missing_values,axis=0)
rs

       age   fare
0    False  False
1    False  False
2    False  False
3    False  False
4    False  False
..     ...    ...
886  False  False
887  False  False
888   True  False
889  False  False
890  False  False

[891 rows x 2 columns]

### ※ 문제181. 위의 결과가 True, False로 나오는게 아니라 결측치의 개수로 나오게 함수를 수정하시오

In [16]:
import seaborn as sns

tit = sns.load_dataset('titanic')
df = tit.loc[:,['age','fare']]

def missing_values(series):
    return series.isnull().sum()

rs = df.apply(missing_values,axis=0)
rs

age     177
fare      0
dtype: int64

### ※ 문제182. kaggle의 타이타닉 나이 데이터의 결측치 177개를 나이 데이터의 중앙값으로 치환하시오

In [18]:
df['age'].fillna(df['age'].median(), inplace=True)
df.age.isnull().sum()

0

### ※ 문제183. 어제는 타이타닉 생존자 예측을 위해서 kNN 모델을 만들때 나이의 결측치를 아래와 같이 테스트 했는데 오늘 중앙값으로 놓고 정확도를 확인하시오

In [25]:
import  pandas  as  pd
import  seaborn  as  sns 

df = sns.load_dataset('titanic')

pd.set_option('display.max_columns', 15 ) 

rdf = df

## 값 치환
rdf['age'].fillna(rdf['age'].median(), inplace=True) # 중앙값으로 치환
rdf['deck'].fillna(rdf['deck'].value_counts(dropna=True).idxmax(), inplace=True) # 최빈값으로 치환
rdf['embark_town'].fillna(rdf['embark_town'].value_counts(dropna=True).idxmax(),inplace=True) # 최빈값으로 치환
rdf['embarked'].fillna(rdf['embarked'].value_counts(dropna=True).idxmax() , inplace=True ) 
# rdf.isnull().sum()

## dummies
deck_dummies = pd.get_dummies(rdf['deck'], prefix='deck')
rdf = pd.concat([rdf, deck_dummies], axis=1)

gender = pd.get_dummies( rdf['sex'] ) 
rdf = pd.concat( [rdf, gender], axis=1 ) 

onehot_embarked = pd.get_dummies( rdf['embarked'], prefix='town') 
rdf = pd.concat([ rdf, onehot_embarked], axis=1)

class_dummies = pd.get_dummies(rdf['class'])
rdf = pd.concat([rdf, class_dummies], axis=1)

et_dummies = pd.get_dummies(rdf['embark_town'], prefix='embarked')
rdf = pd.concat([rdf, et_dummies], axis=1)

rdf.drop( ['sex', 'embarked', 'class', 'embark_town', 'deck'],  axis=1, inplace=True ) # 명목형 column 삭제

X = rdf[ [ 'pclass' ,'age', 'sibsp','parch', 'female', 'male', 'town_C', 'town_Q',  'town_S','embarked_Cherbourg','embarked_Queenstown','embarked_Southampton','First','Second','Third']]
y = rdf['survived']   

from  sklearn   import   preprocessing
X = preprocessing.StandardScaler().fit(X).transform(X)

from  sklearn.model_selection  import   train_test_split
X_train, X_test, y_train, y_test =train_test_split( X, y, test_size=0.3, random_state = 4 ) # random_state값 변경

from  sklearn.neighbors  import   KNeighborsClassifier 

knn = KNeighborsClassifier( n_neighbors=17 ) 
knn.fit ( X_train, y_train )

y_hat = knn.predict( X_test ) 

from  sklearn   import   metrics 
knn_matrix  =  metrics.confusion_matrix( y_test,  y_hat )
print(knn_matrix)

from sklearn.metrics import accuracy_score

accuracy = accuracy_score( y_test, y_hat)
print(accuracy)

[[171   7]
 [ 33  57]]
0.8507462686567164